MAIN_MENU_TEXT = '👋 Привет!\nЯ - бот по рассылке сообщений для ИТ-школы.\n\n⬇️ Выбери пункт ниже.'
ADD_CHATS = """📋 Инструкция по добавлению меня в чат:

1️⃣ Скопируй мой id.

2️⃣ В группе нажми “Добавить участников” и подставь мой id. Добавь меня в группу.

3️⃣ Теперь мне нужно выдать права. Для этого зайди в управление группой → администраторы → добавить администратора. И добавь меня. Выдай мне следующие права:
  - Удаление сообщений
  - Управление темами

4️⃣ Сохрани изменения.

5️⃣ Теперь отправь мне сообщение <code>/start</code> в том чате, куда мне отправлять уведомления - так я сохраню этот чат у себя в памяти.

6️⃣ Если хочешь, чтобы я показывал FAQ, то в соответствующем чате напиши мне <code>/FAQ</code> и я сохраню этот чат для показа меню с вопросами и ответами.


✅ Если всё сделано верно, я пришлю тебе информацию об успешном добавлении меня в чат!"""
DEL_CHAT = '⬇️ Выбери чат, откуда меня нужно удалить'
COPY_CHAT_FROM = (
    '📤 Выберите чат, <u>откуда</u> копировать сообщения.\n\n'
    'ℹ️ Сообщения будут скопированы без времени отправки.\n'
    '⚠️ При вставке скопированных сообщений в чат система сначала удалит все текущие сообщения, а потом разместит скопированные.'
)
COPY_CHAT_IN = (
    '📥 Выберите чат, <u>куда</u> копировать сообщения.\n\n'
    'ℹ️ Сообщения будут скопированы без времени отправки.\n'
    '⚠️ При вставке скопированных сообщений в чат система сначала удалит все текущие сообщения, а потом разместит скопированные.'
)
FIND_CHAT = '🔍 Введите название чата для поиска'
CHAT_NAME = '✏️ Введите название чата'
CHAT_NAME_INFO = 'ℹ️ Имя чата измениться только в боте.'
ALERT_COPY_CHAT = '⚠️ Нельзя копировать сообщения в один и тот же чат!'
COPY_MESSAGES_PROCESS = '🔄️ Копирование сообщений...'
DEL_CHAT_PROCESS = '🔄️ Удаление чата...'
DEL_MESSAGE_PROCESS = '🔄️ Удаление сообщения...'
FIND_CHAT_PROCESS = '🔄️ Поиск чатов...'
FIND_MESSAGE_PROCESS = '🔄️ Поиск сообщений...'
DOWNLOAD_MSGS_FROM_EXCEL_PROCESS = '🔄️ Загрузка сообщений...'
NO_TEXT = '⚠️ Упс! Это не текст.'
FOUND_CHATS = '⬇️ Найденные чаты'
NOT_FOUND_CHATS = '❌ Чаты не найдены'
NAME_MESSAGE = '✏️ Введите название сообщения'
TEXT_MESSAGE = '📝 Введите текст сообщения'
TIME_SEND_MESSAGE = '🕒 Введите дату и время сообщения в формате:\nДД.ММ.ГГГГ ЧЧ:ММ\n\nНапример: 12.01.2026 15:03'
MESSAGE_STICKER_SENT = '✅'
MESSAGE_TEXT_SENT = 'Отправлено'
MESSAGE_STICKER_PLANNED = '🕒'
MESSAGE_TEXT_PLANNED = 'Будет отправлено'
MESSAGE_STICKER_NONE = ''
MESSAGE_TEXT_NONE = ''
ERROR_TYPE_DATETIME = '⚠️ Упс! Некорректная дата или время.'
ERROR_DATETIME = '⚠️ Упс! Дата и время должны быть больше настоящего момента.'
FIND_MESSAGE = '🔍 Введите название сообщения для поиска'
FOUND_MESSAGES = '⬇️ Найденные сообщения'
NOT_FOUND_MESSAGES = '❌ Сообщения не найдены'
DOWNLOAD_MESSAGES_FROM_EXCEL = (
    '📥 Загрузите файл таблицы с расширением xlsx.\n\n'
    'ℹ️ Дата и время отправки сообщений в документе должны быть больше настоящего момента.'
)
INCORRECT_EXTENSION = '⚠️ Упс! Файл должен быть загружен в формате xlsx'
COLUMN_DATETIME_NAME = 'Дата и время отправки'
ERROR_WORK_EXCEL = '⚠️ Упс! Произошла ошибка про обработке файла. Попробуйте снова или свяжитесь с администратором.'
ADD_USER_FIO = '✏️ Введите ФИО пользователя в формате: <code>Фамилия Имя Отчество</code>'
INCORRECT_INFO_USER = '⚠️ Упс! Неверный формат ФИО'
ADD_USER_ROLE = '🎭 Введите роль пользователя'
