MAIN_MENU_TEXT = '👋 Привет!\nЯ - бот по рассылке сообщений для ИТ-школы.\n\n⬇️ Выбери пункт ниже.'
ADD_CHATS = '''📋 Инструкция по добавлению меня в чат:

1️⃣ Скопируй мой id.

2️⃣ В группе нажми “Добавить участников” и подставь мой id. Добавь меня в группу.

3️⃣ Теперь мне нужно выдать права. Для этого зайди в управление группой → администраторы → добавить администратора. И добавь меня. Выдай мне следующие права:
  - Удаление сообщений
  - Управление темами

4️⃣ Сохрани изменения.

5️⃣ Теперь отправь мне сообщение <code>/start</code> в том чате, куда мне отправлять уведомления - так я сохраню этот чат у себя в памяти.

6️⃣ Если хочешь, чтобы я показывал FAQ, то в соответствующем чате напиши мне <code>/FAQ</code> и я сохраню этот чат для показа меню с вопросами и ответами.


✅ Если всё сделано верно, я пришлю тебе информацию об успешном добавлении меня в чат!'''
DEL_CHAT = '⬇️ Выбери чат, откуда меня нужно удалить'
COPY_CHAT_FROM = ('📤 Выберите чат, <u>откуда</u> копировать сообщения.\n\n'
                  'ℹ️ Сообщения будут скопированы без времени отправки.\n'
                  '⚠️ При вставке скопированных сообщений в чат система сначала удалит все текущие сообщения, а потом разместит скопированные.')
COPY_CHAT_IN = ('📥 Выберите чат, <u>куда</u> копировать сообщения.\n\n'
                'ℹ️ Сообщения будут скопированы без времени отправки.\n'
                '⚠️ При вставке скопированных сообщений в чат система сначала удалит все текущие сообщения, а потом разместит скопированные.')
FIND_CHAT = '🔍 Введите название чата для поиска'
ALERT_COPY_CHAT = '⚠️ Нельзя копировать сообщения в один и тот же чат!'
COPY_MESSAGES = '🔄️ Копирование сообщений...'
DEL_CHAT_PROCESS = '🔄️ Удаление чата...'
NO_TEXT_CHAT = 'Введите название чата для поиска в виде строки. Например: <code>Python</code>'
FOUND_CHATS = '⬇️ Найденные чаты'
NOT_FOUND_CHATS = '❌ Чаты не найдены'







